# Built In Failures Electrical Failures Number Of Circuit Full On Switch Panel Property

Source: https://www.revitapidocs.com/2026/cffe6141-6232-dd6d-d319-650e80b83b57.htm

---

| Built In Failures Electrical Failures Number Of Circuit Full On Switch Panel Property |
| --- |

You can't connect to switchboard \[Panel Name] because there aren't enough space. \\nYou can increase the number of circuits to be greater than \[Number] to connect through breakers.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId NumberOfCircuitFullOnSwitchPanel { get; }
```

```
Public Shared ReadOnly Property NumberOfCircuitFullOnSwitchPanel As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ NumberOfCircuitFullOnSwitchPanel {
	FailureDefinitionId^ get ();
}
```

```
static member NumberOfCircuitFullOnSwitchPanel : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ElectricalFailures Class Autodesk.Revit.DB Namespace